# Код Морзе для представления цифр и букв использует тире и точки.',
# Напишите программу для кодирования текстового сообщения в соответствии с кодом Морзе.',

# окно Заменить
# ^([A-Z0-9]) -> '\1   	(режим регулярных выражений)
# \t -> ': '    		(расширенный режим поиска)
# ([.-])$ -> \1',    	(режим регулярных выражений)

morse = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.',
		'G': '--.', 'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..',
		'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.', 
		'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-', 
		'Y': '-.--', 'Z': '--..', '0': '-----', '1': '.----', '2': '..---', 
		'3': '...--', '4': '....-', '5': '.....', '6': '-....','7': '--...', 
		'8': '---..', '9': '----.'}

while s := input().upper():
	# res = []
	# for c in s:
		# res += morse[c]
	res = [morse[c] for c in s]
	print(*res)
